#We are learning Pandas in this session
###     In this we learn some basic stuff of pandas in python

In [1]:
import pandas as pd

##we are importing data into pandas to perform some operations

In [3]:
df = pd.read_csv('people-example.csv')

In [4]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

##we perform some basic operations on this dataset

In [6]:
df.tail()

  First Name Last Name        Country  age
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [7]:
df.head()

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23

In [8]:
df.columns #this give all the columns of the dataset

Index([u'First Name', u'Last Name', u'Country', u'age'], dtype='object')

In [9]:
df.describe #This does not look good

<bound method DataFrame.describe of   First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25>

In [11]:
df.dtypes #give the type of data

First Name    object
Last Name     object
Country       object
age            int64
dtype: object

In [12]:
df.dtypes['Country']

dtype('O')

In [13]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

##Adding a column to the dataset

In [14]:
df['Full Name'] = df['First Name'] + " " + df['Last Name']

In [15]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

##Dropping the column NEW

In [45]:
df = df.drop('Full Name', axis=1)

In [46]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [48]:
blocks = [df[['First Name', 'Last Name']], df[['Country']]]
df2 = pd.concat(blocks, axis=1)

In [50]:
df2

  First Name Last Name        Country
0        Bob     Smith  United States
1      Alice  Williams         Canada
2    Malcolm      Jone        England
3      Felix     Brown            USA
4       Alex    Cooper         Poland
5        Tod  Campbell  United States
6      Derek      Ward    Switzerland

In [53]:
df.stack()

0  First Name              Bob
   Last Name             Smith
   Country       United States
   age                      24
1  First Name            Alice
   Last Name          Williams
   Country              Canada
   age                      23
2  First Name          Malcolm
   Last Name              Jone
   Country             England
   age                      22
3  First Name            Felix
   Last Name             Brown
   Country                 USA
   age                      23
4  First Name             Alex
   Last Name            Cooper
   Country              Poland
   age                      23
5  First Name              Tod
   Last Name          Campbell
   Country       United States
   age                      22
6  First Name            Derek
   Last Name              Ward
   Country         Switzerland
   age                      25
dtype: object

In [55]:
df.unstack()

First Name  0              Bob
            1            Alice
            2          Malcolm
            3            Felix
            4             Alex
            5              Tod
            6            Derek
Last Name   0            Smith
            1         Williams
            2             Jone
            3            Brown
            4           Cooper
            5         Campbell
            6             Ward
Country     0    United States
            1           Canada
            2          England
            3              USA
            4           Poland
            5    United States
            6      Switzerland
age         0               24
            1               23
            2               22
            3               23
            4               23
            5               22
            6               25
dtype: object

##Using lambda functions is python

In [57]:
df['age'].apply(lambda x: x**2)

0    576
1    529
2    484
3    529
4    529
5    484
6    625
Name: age, dtype: int64

In [23]:
df.iloc[0] #Retrives the row of thet column

First Name              Bob
Last Name             Smith
Country       United States
age                      24
Full Name         Bob Smith
Name: 0, dtype: object

In [25]:
df[0:3] #Gives those columns with 0 thru 2

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone

In [29]:
df.at[2,'First Name'] #Get value fot that particulalar row and that column

'Malcolm'

In [42]:
temp = df[df['Country'].isin(['United States'])]  #Filter condition 1
temp[temp['First Name'].isin(['Bob'])] #Filter condition 2

  First Name Last Name        Country  age  Full Name
0        Bob     Smith  United States   24  Bob Smith

## Some advanced function in Panda dataframes

In [12]:
df.apply(lambda x: x['First Name'] +" "+ x['Last Name'], axis=1)

0         Bob Smith
1    Alice Williams
2      Malcolm Jone
3       Felix Brown
4       Alex Cooper
5      Tod Campbell
6        Derek Ward
dtype: object

In [15]:
df.sort('First Name', ascending=True) #Sorts the column

  First Name Last Name        Country  age
4       Alex    Cooper         Poland   23
1      Alice  Williams         Canada   23
0        Bob     Smith  United States   24
6      Derek      Ward    Switzerland   25
3      Felix     Brown            USA   23
2    Malcolm      Jone        England   22
5        Tod  Campbell  United States   22

In [22]:
df.groupby('Country').first()

              First Name Last Name  age
Country
Canada             Alice  Williams   23
England          Malcolm      Jone   22
Poland              Alex    Cooper   23
Switzerland        Derek      Ward   25
USA                Felix     Brown   23
United States        Bob     Smith   24

In [8]:
df['Last Name'].value_counts()

Williams    1
Smith       1
Ward        1
Campbell    1
Jone        1
Cooper      1
Brown       1
dtype: int64

In [12]:
df.size #Gives number of records in the nd array ie total no records including headers

28

In [15]:
df.T #Transpose on the original dataset

,0,1,2,3,4,5,6
First Name,Bob,Alice,Malcolm,Felix,Alex,Tod,Derek
Last Name,Smith,Williams,Jone,Brown,Cooper,Campbell,Ward
Country,United States,Canada,England,USA,Poland,United States,Switzerland
age,24,23,22,23,23,22,25

In [21]:
df.memory_usage()

First Name    56
Last Name     56
Country       56
age           56
dtype: int64

In [23]:
df.rank()

   First Name  Last Name  Country  age
0           3          5      6.5  6.0
1           2          7      1.0  4.0
2           6          4      2.0  1.5
3           5          1      5.0  4.0
4           1          3      3.0  4.0
5           7          2      6.5  1.5
6           4          6      4.0  7.0